{
  "backend/main.mo": "Motoko actor defining the backend data model and storage for a small business manager app, including types and CRUD-style functions for products, customers, invoices, and expenses, plus helpers for dashboard metrics like monthly revenue and low-stock reminders.",
  "feature_evidence.json": "Feature evidence report confirming that the currency formatting utility in frontend/src/lib/utils.ts was updated to use the 'en-IN' locale and 'INR' currency code to display ₹ instead of $ across all monetary displays in the app.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-sentence summaries of key frontend source files, documenting their roles and notable changes such as importing Invoice from a local lib/types instead of the backend module.",
  "frontend/index.css": "Global Tailwind CSS stylesheet that defines CSS custom properties for the design system's color tokens in both light and dark themes, including background, foreground, chart, and sidebar variables.",
  "frontend/index.html": "Root HTML entry point for the SmallBiz Manager app that mounts the React application into a div#root element and loads the main TypeScript module.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with routes for Dashboard, Customers, Inventory, Invoices, Expenses, and Reports pages, wrapped in a ThemeProvider and Toaster.",
  "frontend/src/components/ConfirmDeleteDialog.tsx": "Reusable alert dialog component for confirming destructive delete actions, accepting configurable title, description, loading state, and onConfirm callback props.",
  "frontend/src/components/CustomerDetail.tsx": "Modal dialog component that displays detailed customer information and their associated invoices list, including total revenue from paid invoices formatted with the INR currency utility.",
  "frontend/src/components/CustomerForm.tsx": "Modal form component for creating or editing a customer, with validation for required name and email fields and integration with React Query mutation hooks.",
  "frontend/src/components/ExpenseForm.tsx": "A dialog form component for adding or editing an expense, with fields for category, amount, description, and date, plus validation and toast notifications on save.",
  "frontend/src/components/InvoiceDetail.tsx": "A read-only dialog that displays invoice details (customer, status, line items, totals) and allows updating the invoice status via a dropdown select.",
  "frontend/src/components/InvoiceForm.tsx": "A dialog form for creating a new invoice, supporting customer selection, due date, status, and dynamic line items sourced from existing products with total calculation.",
  "frontend/src/components/Layout.tsx": "Wraps the app in a sidebar layout with a top header showing a sidebar trigger and app name, a main content area, and a branded footer.",
  "frontend/src/components/MetricCard.tsx": "A reusable card component that displays a titled metric value with an optional subtitle and icon, supporting multiple color variants.",
  "frontend/src/components/ProductForm.tsx": "A dialog form for adding or editing a product, with fields for name, description, price, stock quantity, and category, including validation and toast feedback.",
  "frontend/src/components/Sidebar.tsx": "The application sidebar component that renders navigation links (Dashboard, Customers, Inventory, Invoices, Expenses, Reports) with active-state highlighting using TanStack Router.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an ICP actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes due to identity updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login/logout functionality, persisting identity across page reloads via AuthClient and exposing status flags through a React context and hook.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for CRUD operations on customers, products, invoices, and expenses, interacting with the ICP backend actor and managing local query cache updates.",
  "frontend/src/index.css": "Global stylesheet that imports Inter font, sets up Tailwind CSS layers, and defines CSS custom properties for a light/dark amber-and-green design token palette.",
  "frontend/src/lib/types.ts": "Defines a local TypeScript Invoice interface that mirrors the backend's Invoice structure, since it is not directly exported from the backend.",
  "frontend/src/lib/utils.ts": "Utility functions for class name merging, currency/date formatting in Indian locale, nanosecond timestamp conversion, and ID generation.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/Customers.tsx": "Customers page that displays a searchable, paginated table of customers with actions to add, edit, view details, and delete, using query hooks and toast notifications.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page that aggregates invoice, customer, product, and expense data into metric cards, a monthly revenue chart, and a recent invoices list.",
  "frontend/src/pages/Expenses.tsx": "Expenses page that lists all expenses in a sortable table with edit/delete actions, and shows a current-month spending summary broken down by category.",
  "frontend/src/pages/Inventory.tsx": "Inventory page displaying a searchable, filterable product table with low-stock warnings and support for adding, editing, and deleting products.",
  "frontend/src/pages/Invoices.tsx": "Invoices page that renders a status-filtered invoice table with options to create new invoices and view invoice details in a modal.",
  "frontend/src/pages/Reports.tsx": "Reports page showing yearly monthly revenue bar charts, top 5 products by sales, and a current-month revenue vs. expenses comparison derived from invoice and expense data.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom OKLCH-based color tokens, border radii, box shadows, fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the project state (version 5) for a small business management app using Indian Rupees, listing existing features (dashboard, CRM, inventory, invoicing, expenses, reports) and architectural notes."
}